{"starinfo":[
  {
    "logoname": "baiyang",
    "name": "Aries",
    "date": "March 21-April 19",
    "td": "enthusiasm",
    "gw": "first house",
    "yy": "positive",
    "tz": "Control",
    "zg": "Mars",
    "ys": "red",
    "zb": "ruby",
    "hm": "5",
    "js": "iron",
    "info": "Aries has a feeling that makes people feel happy when they see it, because they always seem to be so enthusiastic, sunny, optimistic, strong, generous to friends, and straight-forward, but a little temperamental. The Aries man has a chauvinistic character, while the Aries woman is the image of a female man."
  },
  {
    "logoname": "jinniu",
    "name": "Taurus",
    "date": "April 20-May 20",
    "td": "Steady and stubborn",
    "gw": "second house",
    "yy": "Negative",
    "tz": "wealth",
    "zg": "Venus",
    "ys": "pink",
    "zb": "Jade",
    "hm": "6",
    "js": "Wood",
    "info": "Taurus is very conservative and likes stability. Once there is any change, he will feel uneasy in his heart and his personality will be slow, but you are a master of financial management and have unique insights into investment and financial management. Taurus men are a bit egoistic in character, while Taurus women like to invest in themselves and want to live a better life."
  },
  {
    "logoname": "shuangzi",
    "name": "Gemini",
    "date": "May 21 - June 21",
    "td": "changeable heart",
    "gw": "third house",
    "yy": "positive",
    "tz": "Thought",
    "zg": "Mercury",
    "ys": "yellow",
    "zb": "Opal",
    "hm": "7",
    "js": "mercury",
    "info": "Geminis like to pursue novelty, they are a little clever, but they are not patient enough. They often do things in three minutes, and it is difficult to persevere. However, your lovely personality will make many people like to be friends with you. The Gemini man is very attentive on the surface, but is actually affectionate, while the Gemini child likes to seek innovation and change."
  },
  {
    "logoname": "jvxie",
    "name": "Cancer",
    "date": "June 22-July 22",
    "td": "Sensitive tenderness",
    "gw": "4th house",
    "yy": "Negative",
    "tz": "feeling",
    "zg": "moon",
    "ys": "green",
    "zb": "Pearl",
    "hm": "2",
    "js": "gold",
    "info": "Cancer is easy to be sensitive and insecure, easy to focus on one thing, have the perseverance to persevere in doing things, be loyal to friends and family, and be very loyal to friends and family. Cancer men are first-class good men. , Caring and loving family, Cancer women are full of maternal aura, very caring."
  },
  {
    "logoname": "shizi",
    "name": "Leo",
    "date": "July 23-August 22",
    "td": "proud majesty",
    "gw": "Fifth house",
    "yy": "positive",
    "tz": "power",
    "zg": "sun",
    "ys": "red, gold, yellow",
    "zb": "amber",
    "hm": "19",
    "js": "golden",
    "info": "Leo has grand ideals and always wants to rely on his own efforts to become a superior person. You yearn for a sense of superiority, and you also look forward to being admired and admired. You are a little confident and a little arrogant. The lion man is a big man, who loves face, while the lion woman is warm and sunny, and shows loyalty to friends."
  },
  {
    "logoname": "chunv",
    "name": "Virgo",
    "date": "August 23-September 22",
    "td": "perfect rationality",
    "gw": "sixth house",
    "yy": "Negative",
    "tz": "Analytical power",
    "zg": "Mercury",
    "ys": "gray",
    "zb": "Sapphire, Amber",
    "hm": "7",
    "js": "mercury",
    "info": "Although Virgos are often hacked, you still insist on pursuing your own perfectionism, because in your opinion, life cannot be achieved, and the pursuit of perfection cannot be achieved. Progress can only be achieved if there is a goal, and of course it needs encouragement. Virgo men have strong perseverance and persistence, while Virgo women have a strong thirst for knowledge."
  },
  {
    "logoname": "tianping",
    "name": "Libra",
    "date": "September 23 - October 23",
    "td": "fairness and harmony",
    "gw": "7th house",
    "yy": "positive",
    "tz": "weighing choices",
    "zg": "Venus",
    "ys": "brown",
    "zb": "coral, amber",
    "hm": "3",
    "js": "wood",
    "info": "Libras often pursue equality and harmony, are good at observing words, and have strong communication skills, so they have many sincere friends, because you are also sincere enough, but the biggest disadvantage is that they are always hesitant to make choices. Libra men tend to care about themselves and ignore others, while Libra women like to be accompanied."
  },
  {
    "logoname": "tianxie",
    "name": "Scorpio",
    "date": "October 24-November 22",
    "td": "Mysterious and keen",
    "gw": "eighth house",
    "yy": "negative",
    "tz": "eager",
    "zg": "Pluto, Mars",
    "ys": "purple black",
    "zb": "Jasper, Black Crystal",
    "hm": "4",
    "js": "iron",
    "info": "Scorpios are energetic and possessive, they have goals for life, they will never give up until they reach their goals, and they have a strong sense of revenge. Scorpio men are very egoistic, and Scorpio women have a strong sense of self-protection and are not easy to approach."
  },
  {
    "logoname": "sheshou",
    "name": "Sagittarius",
    "date": "November 23-December 21",
    "td": "free optimism",
    "gw": "ninth house",
    "yy": "positive",
    "tz": "freedom",
    "zg": "Jupiter",
    "ys": "light blue",
    "zb": "Amethyst",
    "hm": "6",
    "js": "tin",
    "info": "Sagittarius advocates freedom, is brave, decisive, and independent, and has the energy to move forward. No matter how difficult it is, as long as you think, you can do it. Your perseverance and self-confidence are hard to knock down. Sagittarius men love freedom and hate being bound, while Sagittarius women are simple and direct, not scheming, but willful."
  },
  {
    "logoname": "mojie",
    "name": "Capricorn",
    "date": "December 22-January 19",
    "td": "Obsession with reality",
    "gw": "Tenth House",
    "yy": "negative",
    "tz": "Actual",
    "zg": "Saturn",
    "ys": "Coffee, black",
    "zb": "Black Jade",
    "hm": "4",
    "js": "Silver",
    "info": "Capricorn is the most patient of the twelve signs of the zodiac, for the most careful, is also the most kind sign. They are down-to-earth and stubborn, and will not let go until they achieve their goals. Their endurance is also surprisingly strong, but also very diligent. They always carry a lot of responsibility in their hearts, but are often very insecure and do not trust others completely."
  },
  {
    "logoname": "shuiping",
    "name": "Aquarius",
    "date": "January 20-February 18",
    "td": "Free Fraternity",
    "gw": "Eleventh House",
    "yy": "Positive",
    "tz": "Seeking knowledge",
    "zg": "Uranus",
    "ys": "Bronze",
    "zb": "Black Pearl",
    "hm": "22",
    "js": "Opal",
    "info": "Aquarians are intelligent, their greatest characteristic is innovation, the pursuit of a unique life, individualism is very strong sign. They are friendly and private. Aquarius is definitely a \"friendship star\", he likes to make friends of every kind, but it is difficult to make friends with them, it takes a long time. They are cold and distant to their families."
  },
  {
    "logoname": "shuangyv",
    "name": "Pisces",
    "date": "February 19-March 20",
    "td": "Romantic Fantasy",
    "gw": "Twelfth House",
    "yy": "Negative",
    "tz": "promiscuous",
    "zg": "Neptune",
    "ys": "white",
    "zb": "Ivory stone",
    "hm": "11",
    "js": "Copper",
    "info": "Pisces is the last sign of the zodiac, he gathers the strengths and weaknesses of all the signs in one, while being influenced by the emotional nature of the water signs, adding a more complex touch to their original complex character. The biggest advantage of Pisces people is a kind heart, they are willing to help others, even at the expense of themselves."
  }
]
}